---
type: RoofComponents
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 8
tags: [revit-api, class]
---

# RoofComponents

`Autodesk.Revit.DB.IFC.RoofComponents` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAreasOfCurveLoops | 2014 | `public IList < double > GetAreasOfCurveLoops ()` |
| Method | GetCurveLoops | 2014 | `public IList < CurveLoop > GetCurveLoops ()` |
| Method | GetLoopFaces | 2014 | `public IList < Face > GetLoopFaces ()` |
| Method | GetPlaneDirections | 2014 | `public IList < XYZ > GetPlaneDirections ()` |
| Method | GetPlaneOrigins | 2014 | `public IList < XYZ > GetPlaneOrigins ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ScaledDepth | 2014 | `public double ScaledDepth { get ; }` |